TOKEN = '6620621752:AAE0S49EMA23RgLKftyKcsBMjquw7loenjc'
country_decoder = {
    "Любая 🚩": "Любая",
    "Россия 🇷🇺": "Россия",
    "США 🇺🇸": "США",
    "Британия 🇬🇧": "Великобритания", 
    "Германия 🇩🇪": "Германия",
    "Франция 🇫🇷": "Франция",
    "Испания 🇪🇸": "Испания",
    "Италия 🇮🇹": "Италия"
}
genre_decoder = {
    "Любой 📽️": "Любой 📽️",
    "биография 👤": "биография", 
    "боевик 💣": "боевик", 
    "вестерн 🏜️": "вестерн",
    "военный 🪖": "военный",
    "детектив 🔍": "детектив",
    "мульт 🧸": "мультфильм", 
    "док 📃": "документальный",
    "драма 😥": "драма",
    "история 🏹": "исторический",
    "комедия 😆": "комедия",
    "криминал 🚔": "криминал",
    "мелодрама 👩‍❤️‍👨": "мелодрама",
    "мюзикл 🎵": "мюзикл",
    "приключения 🗺️": "приключения",
    "семейный 👨‍👩‍👦": "семейный",
    "спорт ⚽": "спортивный",
    "триллер 😱": "триллер",
    "ужасы 👻": "ужасы",
    "фантастика 👽": "фантастика",
    "фэнтези 🧙‍♂️": "фэнтези"
}
duration_decoder = {
    "Любая ⏱️": "Любая ⏱️",
    "1-2 часа ▶️": "1-2 часа", 
    "2-3 часа ⏩": "2-3 часа", 
    "более 3 часов ⏭️" : "более 3 часов"
}
year_decoder = {
    "Любой ⏳": "Любой ⏳",
    "до 1970-х 🎸": "до 1970-х", 
    "1970-1980 💃": "1970-1980",
    "1980-1990 🎮": "1980-1990",
    "1990-2000 🎧": "1990-2000",
    "2000-2010 💻": "2000-2010",
    "2010-2020 📱": "2010-2020", 
    "2020- 🌍": "2020-"
}
age_decoder = {
    "Любое 🆗": "Любое 🆗",
    "0+ 👼": "0+", 
    "6+ 👶": "6+", 
    "12+ 👦": "12+", 
    "16+ 🧑": "16+", 
    "18+ 🔞": "18+"
}
rate_kp_decoder = {
    "Любой ➡️": "Любой ➡️",
    "КП Меньше 5 *️⃣": "КП Меньше 5", 
    "КП 5+ 5️⃣": "КП 5+", 
    "КП 6+ 6️⃣": "КП 6+",
    "КП 7+ 7️⃣": "КП 7+", 
    "КП 8+ 8️⃣": "КП 8+", 
    "КП 9+ 9️⃣": "КП 9+"
}
rate_imdb_decoder = {
    "Любой ✅": "Любой ✅",
    "IMDB Меньше 5 *️⃣": "IMDB Меньше 5", 
    "IMDB 5+ 5️⃣": "IMDB 5+", 
    "IMDB 6+ 6️⃣": "IMDB 6+",
    "IMDB 7+ 7️⃣": "IMDB 7+", 
    "IMDB 8+ 8️⃣": "IMDB 8+", 
    "IMDB 9+ 9️⃣": "IMDB 9+"
}